Revit 2026 API

# DockablePane Properties

---

The DockablePane type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Id | The unique identifier for this dockable pane. |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

#### Reference

DockablePane Class

Autodesk.Revit.UI Namespace